; domain
(define
    (domain jaskier)
    (:requirements :adl)
    (:types miasto kamien)
    (:predicates
        (niedostepna ?miejscowosc)
        (ma ?kamien)
        (polaczone ?miejscowosc1 ?miejscowosc2)
        (jaskier-w ?miejscowosc)
        (miejsce-wymiany ?gdzie ?czego ?naco)
    )
    (:action wymien
        :parameters (?gdzie - miasto ?co - kamien ?naco - kamien)
        :precondition
        (and
            (jaskier-w ?gdzie)
            (ma ?co)
            (miejsce-wymiany ?gdzie ?co ?naco)
        )
        :effect
        (and
            (ma ?naco)
            (not (ma ?co))
            (niedostepna ?gdzie)
        )
    )
    (:action przejdz
        :parameters (?skad - miasto ?dokad - miasto)
        :precondition
        (and
            (or (polaczone ?skad ?dokad) (polaczone ?dokad ?skad))
            (not (niedostepna ?dokad))
            (jaskier-w ?skad)
        )
        :effect
        (and
            (jaskier-w ?dokad)
            (not (jaskier-w ?skad))
        )
    )
)

; problem
(define (problem jaskier)
	(:domain Jaskier)
	(:objects
		aon gart ezberg filian dagrod bama cerwa - miasto
        rubin jadeit szafir agat opal - kamien
	)
	(:init
        (polaczone aon dagrod)
        (polaczone aon gart)
        (polaczone bama cerwa)
        (polaczone bama dagrod)
        (polaczone cerwa filian)
        (polaczone dagrod filian)
        (polaczone ezberg filian)
        (polaczone ezberg gart)
        

        (miejsce-wymiany bama opal szafir)
        (miejsce-wymiany cerwa opal agat)
        (miejsce-wymiany dagrod rubin opal)
        (miejsce-wymiany ezberg agat szafir)
        (miejsce-wymiany filian szafir jadeit)
        (miejsce-wymiany gart szafir opal)

        (jaskier-w dagrod)
        (ma rubin)
	)
	(:goal
	(and		
        (jaskier-w aon)
        (ma jadeit)
	)
	)

)

; plan
1. (wymien dagrod rubin opal)
   deleted: (ma rubin)
   added: (ma opal) (niedostepna dagrod)
   goals met: 0 of 2
2. (przejdz dagrod bama)
   deleted: (jaskier-w dagrod)
   added: (jaskier-w bama)
   goals met: 0 of 2
3. (wymien bama opal szafir)
   deleted: (ma opal)
   added: (ma szafir) (niedostepna bama)
   goals met: 0 of 2
4. (przejdz bama cerwa)
   deleted: (jaskier-w bama)
   added: (jaskier-w cerwa)
   goals met: 0 of 2
5. (przejdz cerwa filian)
   deleted: (jaskier-w cerwa)
   added: (jaskier-w filian)
   goals met: 0 of 2
6. (wymien filian szafir jadeit)
   deleted: (ma szafir)
   added: (ma jadeit) (niedostepna filian)
   goals met: 1 of 2
7. (przejdz filian ezberg)
   deleted: (jaskier-w filian)
   added: (jaskier-w ezberg)
   goals met: 1 of 2
8. (przejdz ezberg gart)
   deleted: (jaskier-w ezberg)
   added: (jaskier-w gart)
   goals met: 1 of 2
9. (przejdz gart aon)
   deleted: (jaskier-w gart)
   added: (jaskier-w aon)
   goals met: 2 of 2
